In [1]:
import pandas as pd

## Handle categorical Features

In [10]:
## ordinal number encoding

In [11]:
import datetime

In [12]:
today_date = datetime.datetime.today()

In [13]:
today_date

datetime.datetime(2022, 1, 13, 12, 1, 44, 95958)

In [16]:
today_date-datetime.timedelta(2)

datetime.datetime(2022, 1, 11, 12, 1, 44, 95958)

In [20]:
##list comprehension
days = [today_date - datetime.timedelta(x) for x in range(0,15)]

In [25]:
data = pd.DataFrame(days)
data.columns = ["Day"]

In [26]:
data.head()

                         Day
0 2022-01-13 12:01:44.095958
1 2022-01-12 12:01:44.095958
2 2022-01-11 12:01:44.095958
3 2022-01-10 12:01:44.095958
4 2022-01-09 12:01:44.095958

In [29]:
data["Weekday"]=data["Day"].dt.day_name()

In [30]:
data.head()

                         Day    Weekday
0 2022-01-13 12:01:44.095958   Thursday
1 2022-01-12 12:01:44.095958  Wednesday
2 2022-01-11 12:01:44.095958    Tuesday
3 2022-01-10 12:01:44.095958     Monday
4 2022-01-09 12:01:44.095958     Sunday

In [31]:
dict = {"Monday":1,"Tuesday":2,"Wednesday":3,"Thursday":4,"Friday":5,"Saturday":6,
       "Sunday":7}

In [32]:
dict

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [37]:
data["Weekdayordinal"]=data["Weekday"].map(dict)

In [38]:
data.head()

                         Day    Weekday  Weekdayodinal  Weekdayordinal
0 2022-01-13 12:01:44.095958   Thursday              4               4
1 2022-01-12 12:01:44.095958  Wednesday              3               3
2 2022-01-11 12:01:44.095958    Tuesday              2               2
3 2022-01-10 12:01:44.095958     Monday              1               1
4 2022-01-09 12:01:44.095958     Sunday              7               7

### Count /Frequency encoding

In [45]:
train = pd.read_csv("http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data",header = None,index_col = None)

In [46]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [49]:
len(df[1].unique())

9

In [50]:
columns = [1,3,5,6,7,8,9,13]

In [64]:
df_set[columns]

NameError: name 'df_set' is not defined

In [63]:
df_set= df[columns]

KeyError: "None of [Int64Index([1, 3, 5, 6, 7, 8, 9, 13], dtype='int64')] are in the [columns]"

In [58]:
df.columns = ["Employment",'Degree',"Status",'Designation',"Family_job","Race","Sex","Country"]

In [60]:
df.head()

,Employment,Degree,Status,Designation,Family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [62]:
for feature in df.columns[:]:
    print(feature,":",len(df(feature).unqiue()))

TypeError: 'DataFrame' object is not callable

## Target guided encodig tech
1.ordering the labels acc to target
2. Replace the label by the joint probability of being 1 or 0

In [67]:
df = pd.read_csv("tested.csv",usecols = ["Cabin","Survived"])
df.head()

   Survived Cabin
0         0   NaN
1         1   NaN
2         0   NaN
3         0   NaN
4         1   NaN

In [84]:
df["Cabin"].fillna("Missing",inplace = True)

In [85]:
df.head()

   Survived Cabin
0         0     m
1         1     m
2         0     m
3         0     m
4         1     m

In [86]:
df.head(20)

    Survived Cabin
0          0     m
1          1     m
2          0     m
3          0     m
4          1     m
5          0     m
6          1     m
7          0     m
8          1     m
9          0     m
10         0     m
11         0     m
12         1     B
13         0     m
14         1     E
15         1     m
16         0     m
17         0     m
18         1     m
19         1     m

In [87]:
df["Cabin"]=df["Cabin"].astype(str).str[0]

In [88]:
df.head(20)

    Survived Cabin
0          0     m
1          1     m
2          0     m
3          0     m
4          1     m
5          0     m
6          1     m
7          0     m
8          1     m
9          0     m
10         0     m
11         0     m
12         1     B
13         0     m
14         1     E
15         1     m
16         0     m
17         0     m
18         1     m
19         1     m

In [89]:
df.Cabin.unique()

array(['m', 'B', 'E', 'A', 'C', 'D', 'F', 'G'], dtype=object)

In [90]:
df.groupby(["Cabin"])["Survived"].mean()

Cabin
A    0.428571
B    0.500000
C    0.542857
D    0.384615
E    0.444444
F    0.375000
G    1.000000
m    0.330275
Name: Survived, dtype: float64

In [94]:
df.groupby(["Cabin"])["Survived"].mean().sort_values().index

Index(['m', 'F', 'D', 'A', 'E', 'B', 'C', 'G'], dtype='object', name='Cabin')

In [95]:
ordinal_labels = df.groupby(["Cabin"])["Survived"].mean().sort_values().index

In [96]:

ordinal_labels

Index(['m', 'F', 'D', 'A', 'E', 'B', 'C', 'G'], dtype='object', name='Cabin')

In [98]:
ordinal_labels2= {k:i for i,k in enumerate(ordinal_labels,0)}

In [99]:
ordinal_labels2

{'m': 0, 'F': 1, 'D': 2, 'A': 3, 'E': 4, 'B': 5, 'C': 6, 'G': 7}

In [100]:
df["Cabin_ordinal_label"]=df["Cabin"].map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_ordinal_label
0         0     m                    0
1         1     m                    0
2         0     m                    0
3         0     m                    0
4         1     m                    0

In [102]:
df.drop(columns=["Cabin"],inplace = True)

In [104]:
df.head(20)

    Survived  Cabin_ordinal_label
0          0                    0
1          1                    0
2          0                    0
3          0                    0
4          1                    0
5          0                    0
6          1                    0
7          0                    0
8          1                    0
9          0                    0
10         0                    0
11         0                    0
12         1                    5
13         0                    0
14         1                    4
15         1                    0
16         0                    0
17         0                    0
18         1                    0
19         1                    0

In [105]:
## Mean encodng

In [106]:
mean_ordinal = df.groupby(["Cabin"])["Survived"].mean().to_dict()

KeyError: 'Cabin'

In [ ]:
df["mean_ordinal_encode"]=df["Cabin"].map(mean_ordinal)